
function init_language_sc()
{
    xml["zh"] = {
        "ok" : "确定",
        "cancel" : "取消",
        "reset" : "恢复出厂设置",
        "save" : "保存",
        "tip" : "提示",
        "click" : "左键",
        "menu" : "右键",
        "mid" : "中键",
        "forward" : "前进",
        "back" : "后退",
        "sr" : "上滚",
        "sd" : "下滚",
        "tl" : "左摆",
        "tr" : "右摆",
        "dclick" : "双击",
        "macro" : "宏",
        "media" : "多媒体",
        "combo" : "组合键",
        "dpi" : "DPI循环",
        "fire" : "火力键",
        "off" : "禁用",
        "mouse" : "鼠标",
        "keyboard" : "键盘",

        "fire1" : "根据设置的间隔和次数持续点击左键",
        "fire2" : "开火间隔",
        "fire3" : "ms",
        "fire4" : "开火次数",
        "fire5" : "次",
        "fire6" : "点击次数设置为0时，按下按键一直击发，松开按键结束",

        "mac1" : "新建宏",
        "mac2" : "载入宏",
        "mac3" : "按住循环",
        "mac4" : "循环直到任意键按下",
        "mac5" : "循环",
        "mac6" : "开始录制",
        "mac7" : "停止录制",
        "mac8" : "循环方式",
        "mac9" : "宏内容",
        "mac10" : "修改按键",
        "mac11" : "修改延迟",

        "media1" : "播放器",
        "media2" : "播放/暂停",
        "media3" : "停止播放",
        "media4" : "上一曲",
        "media5" : "下一曲",
        "media6" : "音量+",
        "media7" : "音量-",
        "media8" : "静音",
        "media9" : "计算器",
        "media10" : "邮件",
        "media11" : "浏览器",
        "media12" : "我的电脑",
        "media13" : "收藏夹",
        "media14" : "刷新",
        "media15" : "搜索",
        "media16" : "网页停止",
        "media17" : "网页前进",
        "media18" : "网页后退",

        "msg1" : "当前设备",
        "msg2" : "键位设置",
        "msg3" : "性能设置",
        "msg4" : "综合设置",
        "msg5" : "系统按键",
        "msg6" : "键盘按键",
        "msg7" : "特殊按键",
        "msg8" : "录制宏",
        "msg9" : "设置",
        "msg10" : "板载配置文件",
        "msg11" : "板载配置",
        "msg12" : "本地配置文件加载",
        "msg13" : "+ 自定义配置文件",
        "msg14" : "DPI灵敏度调节",
        "msg15" : "新增档位",
        "msg16" : "DPI即鼠标移速，使用鼠标的DPI按键可快速切换DPI挡位，通过上方编辑或拖动滑块修改DPI设置",
        "msg17" : "回报率",
        "msg18" : "设置鼠标与电脑通信频率，提高轮询率可以降低延迟，但会增加部分功耗",
        "msg19" : "高回报率会对电脑CPU性能与内存频率有一定要求，低配置的电脑可能存在卡顿现象或无法达到预设的回报率",
        "msg20" : "性能模式",
        "msg21" : "电竞模式",
        "msg22" : "标准模式",
        "msg23" : "节能模式",
        "msg24" : "电竞模式开启后传感器发挥最佳性能，但会消耗更多电量",
        "msg25" : "注意：8K回报率已经是最佳性能，无法开启电竞模式",
        "msg26" : "鼠标LOD高度调节",
        "msg27" : "设置传感器在鼠标抬起时，最小工作高度",
        "msg28" : "运动同步",
        "msg29" : "对鼠标移动进行圆滑算法修正，移动轨迹更准确",
        "msg31" : "直线修正",
        "msg32" : "修正直线移动鼠标时的偏移抖动，变成绝对直线移动（游戏中不建议开启）",
        "msg33" : "波纹修正",
        "msg34" : "对高移速情况下进行算法修正，消除波浪形抖动（游戏中不建议开启）",
        "msg35" : "配对接收器",
        "msg36" : "1K或8K接收器配对",
        "msg37" : "立即配对",
        "msg38" : "所有设置都将恢复到出厂状态，请谨慎操作 所有设置都将恢复到出厂状态，请谨慎操作",
        "msg39" : "立即恢复",
        "msg40" : "该操作将会清空所有设置项，确定恢复出厂设置吗？",
        "msg41" : "创建配置",
        "msg42" : "将会以当前配置创建一个新配置文件",
        "msg43" : "请输入配置文件名称",
        "msg44" : "配置切换",
        "msg45" : "进入设置",
        "msg46" : "删除",
        "msg47" : "请保留至少一个键为“左键”功能",
        "msg48" : "我就要改",
        "msg49" : "编辑",
        "msg50" : "请先选择一个按键",
        "msg51" : "最少要保留一档DPI",
        "msg52" : "已达到最大DPI档数",
        "msg53" : "请稍等，正在更新鼠标数据 . . .",
        "msg54" : "设置出错",
        "msg55" : "导出",
        "msg56" : "导入失败，解析出错",
        "msg57" : "已达到最大按键数量",
        "msg58" : "确定要更新这个自定义配置到 ",
        "msg59" : "XY轴单独调节",
        "msg60" : "X轴(横向)",
        "msg61" : "Y轴(纵向)",
        "msg62" : "左右键一键反转",
        "msg63" : "接收器灯效",
        "msg64" : "连接状态和回报率",
        "msg65" : "电池状态",
        "msg66" : "仅警告电池",
        "msg67" : "按键响应时间设置",
        "msg68" : "如果出现双击，请将按键延时调到8ms或更高直至没有双击",
        "msg69" : "警示：调低延时有可能出现按键双击",
        "msg70" : "节能调节",
        "msg71" : "鼠标静置后，到停止工作的时间",
        "msg72" : "平衡最佳性能和最优续航能效，适合办公等常规使用",
        "msg73" : "传感器能效最低，电量消耗最小，续航时间最长",
        "msg74" : "确认要删除吗？",
        "msg75" : "只有当鼠标连接到接收器时才会按照不同回报率对应的颜色点亮，红色(125Hz)，蓝色(250Hz)，黄色(500Hz)，橙色(1000Hz)，紫色(2000Hz)，绿色(4000Hz)，白色(8000Hz)。",
        "msg76" : "根据鼠标当前的电池电量，从绿色（100%）黄色（66%）橙色（33%）和红色（0%）逐渐变化。",
        "msg77" : "始终保持熄灭，仅在鼠标需要充电时闪烁红灯",
        "msg78" : "请稍等，正在初始化...",
        "msg79" : "该配置不适用于当前设备",
        "msg80" : "挡位数",

        "msg81" : "固件下载:",
        "msg82" : "Web固件",
        "msg83" : "蓝牙固件",
        "msg84" : "升级操作步骤:",
        "msg85" : "鼠标WEB固件升级步骤:",
        "msg86" : "第一步鼠标插线连接电脑点击鼠标升级等待升级完成;",
        "msg87" : "第二步接收器插上电脑点击接收器升级等待升级完成。",
        "msg88" : "温馨提示：如无法移动请重新对码。",
        "msg89" : "鼠标蓝牙固件升级:",
        "msg90" : "鼠标插线连接电脑点击鼠标升级等待升级完成即可。",
        "msg91" : "Ghero系列",
        "msg92" : "温馨提示：需要一定时间鼠标信息同步完成后，界面才会显示鼠标电量。",
        "msg93" : "",
        "msg94" : "零29系列",
        "msg95" : "零39系列",
        "msg96" : "G23V2系列",
        "msg97" : "G23系列",
        "msg98" : "G24系列",
        "msg99" : "Ghero系列 专用固件(1.4.0.3)",
        "msg100" : "G23系列 专用固件(1.4.0.3)",
        "msg101" : "G24系列 专用固件(1.4.0.3)",
        "msg102" : "零29系列 专用固件(1.4.0.3)",
        "msg103" : "零39系列 专用固件(1.4.0.3)",
        "msg104" : "Ghero系列 蓝牙固件",
        "msg105" : "G23系列 蓝牙固件",
        "msg106" : "G24系列 蓝牙固件",
        "msg107" : "零29系列 蓝牙固件",
        "msg108" : "零39系列 蓝牙固件",
        "msg109" : "下载固件",
        "msg110" : "G23V2系列 专用固件(1.4.0.3)",
        "msg111" : "G23V2系列 蓝牙固件",
        "msg112" : "Ghero系列 APP固件",
        "msg113" : "G23系列 APP固件",
        "msg114" : "G24系列 APP固件",
        "msg115" : "零29系列 APP固件",
        "msg116" : "零39系列 APP固件",
        "msg117" : "G23V2系列 APP固件",
        "msg118" : "升级支持APP驱动保存4个切换配置，3950版本鼠标增加20000fps设定。",
        "msg119" : "升级完G23系列，专用固件(1.4.0.3)然后安装此驱动。",
        "msg120" : "升级支持鼠标蓝牙模式连接。",
        "msg121" : "下载驱动",
        

        "wec1" : "欢迎来到因科特产品网页驱动",
        "wec2" : "在这里您可以迅速配置您的因科特设备，尝试一些与众不同的设定，并按您的喜好个性化定制您的设备。",
        "wec3" : "当完成配置之后，后台都不用留，只需要保存、关闭、享受即可。",
        "wec4" : "仅支持Chrome和Edge浏览器，目前支持设备 G23/G24/G23V2/零29/零39 鼠标",
        "wec5" : "更多设备正在适配中...",
        "wec6" : "初始化设备",
        "wec7" : "购买 因科特 设备",
        "wec8" : "连接",
        "wec9" : "允许",
        "wec10" : "设置",
        "wec11" : "允许浏览器连接到您的设备",
        "wec12" : "这将在URL栏旁边打开一个设备列表，在列表中选择您的设备，然后单击“连接”。",
        "wec13" : "允许浏览器访问",
        "wec14" : "您的设备如果没有显示，请重新拔插一下，然后重试",
        "wec15" : "鼠标接收器配对",
        "wec16" : "点击配对",
        "wec17" : "主题",
        "wec18" : "明亮主题",
        "wec19" : "深色主题",
        "wec20" : "语言",
        "wec21" : "意见反馈",
        "wec22" : "遇见问题？点击反馈",
        "wec23" : "界面设置",
        "wec24" : "固件工具",
        "wec25" : "配对设置",
        "wec26" : "返回",

        "wec27" : "请选择下方店铺进行购买",
        "wec28" : "天猫官方旗舰店",
        "wec29" : "淘宝官方直营店",
        "wec30" : "抖音官方旗舰店",
        "wec31" : "京东官方旗舰店",

        "wec32" : "官方推荐最低电脑配置",
        "wec33" : "为保证高回报率的使用体验，请确保您的电脑配置能够满足以下最低推荐配置要求，以便发挥鼠标的最佳性能",
        "wec34" : "Intel平台<br>CPU: i7 9700k及以上<br>显卡: NVIDIA GTX1080及以上<br>内存: 16GB及以上",
        "wec35" : "AMD平台<br>CPU: 3600X及以上<br>显卡: AMD RX5700及以上<br>内存: 16GB及以上",
        "wec36" : "显示器：屏幕刷新率240Hz以上",
        "wec37" : "*如开启8K轮询率使用过程中出现丢帧断连情况，<br>可以咨询客服，会由专业售后客服与您指导排查原因",
        "wec38" : "我知道了",

        "wec39" : "打开天猫APP扫一扫",
        "wec40" : "打开淘宝APP扫一扫",
        "wec41" : "打开抖音APP扫一扫",
        "wec42" : "打开京东APP扫一扫",
        "wec43" : "粉色主题",
      };
  /*
    t.ok = "确定";
    t.cancel = "取消";
    t.reset = "恢复出厂设置";

    t.tc_click = "左键";
    t.tc_menu = "右键";
    t.tc_mid = "中键";
    t.tc_forward = "前进";
    t.tc_back = "后退";
    t.tc_sr = "上滚";
    t.tc_sd = "下滚";
    t.tc_tl = "左摆";
    t.tc_tr = "右摆";
    t.tc_dclick = "双击";
    t.tc_macro = "宏定义";
    t.tc_media = "多媒体";
    t.tc_combo = "组合键";
    t.tc_macro = "左键";
    t.tc_macro = "左键";
    t.tc_dpi = "DPI循环";
    t.tc_off = "禁用";

    t.tc_mouse = "鼠标";
    t.tc_keyboard = "键盘";

    t.msg1 = "当前设备";
    t.msg2 = "键位设置";
    t.msg3 = "性能设置";
    t.msg4 = "综合设置";
    t.msg5 = "系统按键";
    t.msg6 = "键盘按键";
    t.msg7 = "特殊按键";
    t.msg8 = "录制宏";
    t.msg9 = "设置";
    t.msg10 = "板载配置文件";
    t.msg11 = "板载配置";
    t.msg12 = "本地配置文件加载";
    t.msg13 = "自定义配置文件";
    t.msg14 = "DPI灵敏度调节";
    t.msg15 = "新增档位";
    t.msg16 = "DPI即鼠标移速，使用鼠标的DPI按键可快速切换DPI挡位，通过上方编辑或拖动滑块修改DPI设置";
    t.msg17 = "回报率";
    t.msg18 = "设置鼠标与电脑通信频率，提高轮询率可以降低延迟，但会增加部分功耗";
    t.msg19 = "高回报率会对电脑CPU性能与内存频率有一定要求，低配置的电脑可能存在卡顿现象或无法达到预设的回报率";
    t.msg20 = "性能模式";
    t.msg21 = "电竞模式";
    t.msg22 = "标准模式";
    t.msg23 = "节能模式";
    t.msg24 = "电竞模式开启后传感器发挥最佳性能，但会消耗更多电量";
    t.msg25 = "注意：8K回报率已经是最佳性能，无法开启电竞模式";
    t.msg26 = "鼠标LOD高度调节";
    t.msg27 = "设置传感器在鼠标抬起时，最小工作高度";
    t.msg28 = "移动同步";
    t.msg29 = "对鼠标移动进行圆滑算法修正，移动轨迹更准确";
    t.msg31 = "直线修正";
    t.msg32 = "修正直线移动鼠标时的偏移抖动，变成绝对直线移动（游戏中不建议开启）";
    t.msg33 = "纹波修正";
    t.msg34 = "对高移速情况下进行算法修正，消除波浪形抖动（游戏中不建议开启）";
    t.msg35 = "配对接收器";
    t.msg36 = "1K或8K接收器配对";
    t.msg37 = "立即配对";
    t.msg38 = "所有设置都将恢复到出厂状态，请谨慎操作 所有设置都将恢复到出厂状态，请谨慎操作";
    t.msg39 = "立即恢复";
    t.msg40 = "";
    t.msg41 = "";*/
}
